In [57]:
import pandas as pd
import numpy as np

In [58]:
df = pd.read_csv("data/ds_salaries.csv")

In [59]:
df.head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [60]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [61]:
df.shape #saber las forma, columnas y filas

(3755, 11)

In [62]:
df.dtypes #saber los tipos de datos, object = string

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [63]:
df.isnull().sum() #saber los valores nulos

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [64]:
df.duplicated().sum() #Saber que datos se repiten

np.int64(1171)

In [65]:
duplicados=pd.DataFrame(df.value_counts())
duplicados[duplicados['count']>1]

                                                                                                                                                                   count
work_year experience_level employment_type job_title          salary  salary_currency salary_in_usd employee_residence remote_ratio company_location company_size
2022      SE               FT              Data Scientist     141525  USD             141525        US                 100          US               M                21
                                                              191475  USD             191475        US                 100          US               M                21
2023      SE               FT              Data Engineer      252000  USD             252000        US                 0            US               M                13
                                                              129000  USD             129000        US                 0            US               M                13
2022      SE               FT              Data Engineer      130000  USD             130000        US                 0            US               M                12
...                                                                                                                                                                  ...
                                           Data Scientist     92000   USD             92000         US                 100          US               L                 2
2023      EX               FT              Data Engineer      235000  USD             235000        US                 0            US               M                 2
          EN               FT              Research Engineer  155000  USD             155000        US                 0            US               M                 2
          SE               FT              Research Scientist 253750  USD             253750        ES                 0            ES               M                 2
2020      EN               FT              Data Engineer      1000000 INR             13493         IN                 100          IN               L                 2

[544 rows x 1 columns]

In [66]:
df.drop_duplicates(inplace = True) #eliminar duplicados

## EDA ##

In [67]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

¿De que país son la mayoría de compañías?

¿En qué puesto se gana más?

Tipo de trabajo, pais de residencia donde mas se cobra

¿El nivel de  experiencia es proporcional al salario?

¿Cuánto se cobra de media por cada nivel de experiencia?

¿En qué tamaño de compañía trabajan más?

¿Por que porcentage promedio se aumenta el salario entre nivel de experiencia?

¿En qué país se cobra  más por tipo de empleo?

Nivel de expriencia más requerido

Quiero decir, ¿Cuáles se repiten más en este set de datos, las empresas medianas, grandes o pequeñas?